ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_gpio_map.h
/* Alternate Output Function */
#define P0_0_AF_ERU0_PDOUT0 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_0_AF_LEDTS0_LINE7	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_0_AF_ERU0_GOUT0  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_0_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_0_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_0_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_1_AF_ERU0_PDOUT1 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_1_AF_LEDTS0_LINE6	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_1_AF_ERU0_GOUT1  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_1_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_1_AF_SCU_VDROP   	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_2_AF_ERU0_PDOUT2 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_2_AF_LEDTS0_LINE5	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_2_AF_ERU0_GOUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_2_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_2_AF_VADC_EMUX02 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_3_AF_ERU0_PDOUT3 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_3_AF_LEDTS0_LINE4	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_3_AF_ERU0_GOUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_3_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_3_AF_VADC_EMUX01 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_4_AF_LEDTS0_LINE3	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_4_AF_LEDTS0_COL3 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_4_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_4_AF_VADC_EMUX00 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_4_AF_WDT_REQUEST 	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_5_AF_LEDTS0_LINE2	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_5_AF_LEDTS0_COL2 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_5_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_6_AF_LEDTS0_LINE1	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_6_AF_LEDTS0_COL1 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_6_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_6_AF_U0C1_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_6_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_7_AF_LEDTS0_LINE0	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_7_AF_LEDTS0_COL0 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_7_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_7_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_7_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_8_AF_LEDTS1_LINE0	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_8_AF_LEDTS0_COLA 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_8_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_8_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_8_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_9_AF_LEDTS1_LINE1	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_9_AF_LEDTS0_COL6 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_9_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_9_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_9_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_10_AF_LEDTS1_LINE2	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_10_AF_LEDTS0_COL5	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_10_AF_U0C0_SELO1 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_10_AF_U0C1_SELO1 	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_11_AF_LEDTS1_LINE3	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_11_AF_LEDTS0_COL4	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_11_AF_U0C0_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_11_AF_U0C0_SELO2 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_11_AF_U0C1_SELO2 	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_12_AF_LEDTS1_LINE4	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_12_AF_LEDTS0_COL3	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_12_AF_LEDTS1_COL3	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_12_AF_U0C0_SELO3 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_13_AF_WDT_REQUEST	XMC_GPIO_MODE_OUTPUT_ALT1
#define P0_13_AF_LEDTS1_LINE5	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_13_AF_LEDTS0_COL2	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_13_AF_LEDTS1_COL2	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_13_AF_U0C0_SELO4 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_14_AF_LEDTS1_LINE6	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_14_AF_LEDTS0_COL1	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_14_AF_LEDTS1_COL1	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_14_AF_U0C0_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_14_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT7
#define P0_15_AF_LEDTS1_LINE7	XMC_GPIO_MODE_OUTPUT_ALT2
#define P0_15_AF_LEDTS0_COL0	XMC_GPIO_MODE_OUTPUT_ALT3
#define P0_15_AF_LEDTS1_COL0	XMC_GPIO_MODE_OUTPUT_ALT4
#define P0_15_AF_U0C0_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT6
#define P0_15_AF_U0C1_MCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT7
#define P1_0_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_0_AF_LEDTS0_COL0 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_0_AF_LEDTS1_COLA 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_0_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P1_1_AF_VADC_EMUX00 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_1_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_1_AF_LEDTS0_COL1 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_1_AF_LEDTS1_COL0 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_1_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P1_1_AF_U0C1_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P1_2_AF_VADC_EMUX01 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_2_AF_CCU40_OUT2  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_2_AF_LEDTS0_COL2 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_2_AF_LEDTS1_COL1 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_2_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P1_3_AF_VADC_EMUX02 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_3_AF_CCU40_OUT3  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_3_AF_LEDTS0_COL3 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_3_AF_LEDTS1_COL2 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_3_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT6
#define P1_3_AF_U0C1_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P1_4_AF_VADC_EMUX10 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_4_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_4_AF_LEDTS0_COL4 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_4_AF_LEDTS1_COL3 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P1_4_AF_U0C0_SELO0  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P1_4_AF_U0C1_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P1_5_AF_VADC_EMUX11 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P1_5_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P1_5_AF_LEDTS0_COLA 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P1_5_AF_U0C0_SELO1  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P1_5_AF_U0C1_SELO2  	XMC_GPIO_MODE_OUTPUT_ALT7
#define P2_0_AF_ERU0_PDOUT3 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_0_AF_CCU40_OUT0  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_0_AF_ERU0_GOUT3  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_0_AF_LEDTS1_COL5 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_0_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P2_0_AF_U0C0_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT7
#define P2_1_AF_ERU0_PDOUT2 	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_1_AF_CCU40_OUT1  	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_1_AF_ERU0_GOUT2  	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_1_AF_LEDTS1_COL6 	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_1_AF_U0C0_DOUT0  	XMC_GPIO_MODE_OUTPUT_ALT6
#define P2_1_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT7
#define P2_10_AF_ERU0_PDOUT1	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_10_AF_CCU40_OUT2 	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_10_AF_ERU0_GOUT1 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_10_AF_LEDTS1_COL4	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_10_AF_U0C1_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT7
#define P2_11_AF_ERU0_PDOUT0	XMC_GPIO_MODE_OUTPUT_ALT1
#define P2_11_AF_CCU40_OUT3 	XMC_GPIO_MODE_OUTPUT_ALT2
#define P2_11_AF_ERU0_GOUT0 	XMC_GPIO_MODE_OUTPUT_ALT3
#define P2_11_AF_LEDTS1_COL3	XMC_GPIO_MODE_OUTPUT_ALT4
#define P2_11_AF_U0C1_SCLKOUT	XMC_GPIO_MODE_OUTPUT_ALT6
#define P2_11_AF_U0C1_DOUT0 	XMC_GPIO_MODE_OUTPUT_ALT7

/* HW control options */
#define P0_0_HWCTRL_LEDTS0_TSIN7      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_1_HWCTRL_LEDTS0_TSIN6      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_2_HWCTRL_LEDTS0_TSIN5      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_LEDTS0_TSIN4      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_LEDTS0_TSIN3      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_LEDTS0_TSIN2      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_6_HWCTRL_LEDTS0_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_7_HWCTRL_LEDTS0_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_8_HWCTRL_LEDTS1_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_9_HWCTRL_LEDTS1_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_10_HWCTRL_LEDTS1_TSIN2     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_11_HWCTRL_LEDTS1_TSIN3     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_12_HWCTRL_LEDTS1_TSIN4     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_13_HWCTRL_LEDTS1_TSIN5     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_14_HWCTRL_LEDTS1_TSIN6     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_15_HWCTRL_LEDTS1_TSIN7     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_0_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_1_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_2_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_3_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL2
#endif


