ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc1_gpio_map.h
/* HW control options */
#define P0_0_HWCTRL_LEDTS0_TSIN7      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_1_HWCTRL_LEDTS0_TSIN6      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_2_HWCTRL_LEDTS0_TSIN5      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_3_HWCTRL_LEDTS0_TSIN4      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_4_HWCTRL_LEDTS0_TSIN3      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_5_HWCTRL_LEDTS0_TSIN2      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_6_HWCTRL_LEDTS0_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_7_HWCTRL_LEDTS0_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_8_HWCTRL_LEDTS1_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_9_HWCTRL_LEDTS1_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_10_HWCTRL_LEDTS1_TSIN2     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_11_HWCTRL_LEDTS1_TSIN3     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_12_HWCTRL_LEDTS1_TSIN4     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_13_HWCTRL_LEDTS1_TSIN5     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_14_HWCTRL_LEDTS1_TSIN6     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P0_15_HWCTRL_LEDTS1_TSIN7     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P1_0_HWCTRL_U0C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_1_HWCTRL_U0C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_2_HWCTRL_U0C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P1_3_HWCTRL_U0C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_1_HWCTRL_U1C0_DOUT3        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_2_HWCTRL_U1C0_DOUT2        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_3_HWCTRL_U1C0_DOUT1        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P3_4_HWCTRL_U1C0_DOUT0        	XMC_GPIO_HWCTRL_PERIPHERAL2
#define P4_4_HWCTRL_LEDTS2_TSIN0      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_5_HWCTRL_LEDTS2_TSIN1      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_6_HWCTRL_LEDTS2_TSIN2      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_7_HWCTRL_LEDTS2_TSIN3      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_8_HWCTRL_LEDTS2_TSIN4      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_9_HWCTRL_LEDTS2_TSIN5      	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_10_HWCTRL_LEDTS2_TSIN6     	XMC_GPIO_HWCTRL_PERIPHERAL1
#define P4_11_HWCTRL_LEDTS2_TSIN7     	XMC_GPIO_HWCTRL_PERIPHERAL1
#endif

#endif /* XMC1_GPIO_MAP_H */
